Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_cmu.h
#define    CMU_IER_LFDET_IE_Pos                                   (0U)
#define    CMU_IER_LFDET_IE_Msk                                   (0x1U << CMU_IER_LFDET_IE_Pos)
#define    CMU_IER_LFDET_IE                                       CMU_IER_LFDET_IE_Msk

#define    CMU_ISR_HFDETO_Pos                                     (9U)
#define    CMU_ISR_HFDETO_Msk                                     (0x1U << CMU_ISR_HFDETO_Pos)
#define    CMU_ISR_HFDETO                                         CMU_ISR_HFDETO_Msk

#define    CMU_ISR_LFDETO_Pos                                     (8U)
#define    CMU_ISR_LFDETO_Msk                                     (0x1U << CMU_ISR_LFDETO_Pos)
#define    CMU_ISR_LFDETO                                         CMU_ISR_LFDETO_Msk

#define    CMU_ISR_LOL_IF_Pos                                     (3U)
#define    CMU_ISR_LOL_IF_Msk                                     (0x1U << CMU_ISR_LOL_IF_Pos)
#define    CMU_ISR_LOL_IF                                         CMU_ISR_LOL_IF_Msk

#define    CMU_ISR_SYSCSE_IF_Pos                                  (2U)
#define    CMU_ISR_SYSCSE_IF_Msk                                  (0x1U << CMU_ISR_SYSCSE_IF_Pos)
#define    CMU_ISR_SYSCSE_IF                                      CMU_ISR_SYSCSE_IF_Msk

#define    CMU_ISR_HFDET_IF_Pos                                   (1U)
#define    CMU_ISR_HFDET_IF_Msk                                   (0x1U << CMU_ISR_HFDET_IF_Pos)
#define    CMU_ISR_HFDET_IF                                       CMU_ISR_HFDET_IF_Msk

#define    CMU_ISR_LFDET_IF_Pos                                   (0U)
#define    CMU_ISR_LFDET_IF_Msk                                   (0x1U << CMU_ISR_LFDET_IF_Pos)
#define    CMU_ISR_LFDET_IF                                       CMU_ISR_LFDET_IF_Msk

#define    CMU_OPCCR1_EXTICKS_Pos                                 (30U)
#define    CMU_OPCCR1_EXTICKS_Msk                                 (0x1U << CMU_OPCCR1_EXTICKS_Pos)
#define    CMU_OPCCR1_EXTICKS                                     CMU_OPCCR1_EXTICKS_Msk

#define    CMU_OPCCR1_LPUARTCKS_Pos                               (24U)
#define    CMU_OPCCR1_LPUARTCKS_Msk                               (0x3U << CMU_OPCCR1_LPUARTCKS_Pos)
#define    CMU_OPCCR1_LPUARTCKS                                   CMU_OPCCR1_LPUARTCKS_Msk

#define    CMU_OPCCR1_UART5CKS_Pos                                (18U)
#define    CMU_OPCCR1_UART5CKS_Msk                                (0x3U << CMU_OPCCR1_UART5CKS_Pos)
#define    CMU_OPCCR1_UART5CKS                                    CMU_OPCCR1_UART5CKS_Msk

#define    CMU_OPCCR1_UART4CKS_Pos                                (16U)
#define    CMU_OPCCR1_UART4CKS_Msk                                (0x3U << CMU_OPCCR1_UART4CKS_Pos)
#define    CMU_OPCCR1_UART4CKS                                    CMU_OPCCR1_UART4CKS_Msk

#define    CMU_OPCCR1_BT16CKS_Pos                                 (12U)
#define    CMU_OPCCR1_BT16CKS_Msk                                 (0x3U << CMU_OPCCR1_BT16CKS_Pos)
#define    CMU_OPCCR1_BT16CKS                                     CMU_OPCCR1_BT16CKS_Msk

#define    CMU_OPCCR1_LPT16CKS_Pos                                (8U)
#define    CMU_OPCCR1_LPT16CKS_Msk                                (0x3U << CMU_OPCCR1_LPT16CKS_Pos)
#define    CMU_OPCCR1_LPT16CKS                                    CMU_OPCCR1_LPT16CKS_Msk

#define    CMU_OPCCR1_UART3CKS_Pos                                (6U)
#define    CMU_OPCCR1_UART3CKS_Msk                                (0x3U << CMU_OPCCR1_UART3CKS_Pos)
#define    CMU_OPCCR1_UART3CKS                                    CMU_OPCCR1_UART3CKS_Msk

#define    CMU_OPCCR1_UART2CKS_Pos                                (4U)
#define    CMU_OPCCR1_UART2CKS_Msk                                (0x3U << CMU_OPCCR1_UART2CKS_Pos)
#define    CMU_OPCCR1_UART2CKS                                    CMU_OPCCR1_UART2CKS_Msk

#define    CMU_OPCCR1_UART1CKS_Pos                                (2U)
#define    CMU_OPCCR1_UART1CKS_Msk                                (0x3U << CMU_OPCCR1_UART1CKS_Pos)
#define    CMU_OPCCR1_UART1CKS                                    CMU_OPCCR1_UART1CKS_Msk

#define    CMU_OPCCR1_UART0CKS_Pos                                (0U)
#define    CMU_OPCCR1_UART0CKS_Msk                                (0x3U << CMU_OPCCR1_UART0CKS_Pos)
#define    CMU_OPCCR1_UART0CKS                                    CMU_OPCCR1_UART0CKS_Msk

#define    CMU_AMCR_MPRIL_Pos                                     (0U)
#define    CMU_AMCR_MPRIL_Msk                                     (0x1U << CMU_AMCR_MPRIL_Pos)
#define    CMU_AMCR_MPRIL                                         CMU_AMCR_MPRIL_Msk

#define    CMU_CFDCR_CKS_Pos                                      (2U)
#define    CMU_CFDCR_CKS_Msk                                      (0x3U << CMU_CFDCR_CKS_Pos)
#define    CMU_CFDCR_CKS                                          CMU_CFDCR_CKS_Msk

#define    CMU_CFDCR_CKRS_Pos                                     (0U)
#define    CMU_CFDCR_CKRS_Msk                                     (0x3U << CMU_CFDCR_CKRS_Pos)
#define    CMU_CFDCR_CKRS                                         CMU_CFDCR_CKRS_Msk

#define    CMU_CFDER_CKE_Pos                                      (1U)
#define    CMU_CFDER_CKE_Msk                                      (0x1U << CMU_CFDER_CKE_Pos)
#define    CMU_CFDER_CKE                                          CMU_CFDER_CKE_Msk

#define    CMU_CFDER_CKRE_Pos                                     (0U)
#define    CMU_CFDER_CKRE_Msk                                     (0x1U << CMU_CFDER_CKRE_Pos)
#define    CMU_CFDER_CKRE                                         CMU_CFDER_CKRE_Msk

#define    FL_CMU_GROUP1_BUSCLK_LPTIM16                           (0x1U << 0U)
#define    FL_CMU_GROUP1_BUSCLK_RTC                               (0x1U << 2U)
#define    FL_CMU_GROUP1_BUSCLK_PMU                               (0x1U << 3U)
#define    FL_CMU_GROUP1_BUSCLK_SCU                               (0x1U << 4U)
#define    FL_CMU_GROUP1_BUSCLK_IWDT                              (0x1U << 5U)
#define    FL_CMU_GROUP1_BUSCLK_ANAC                              (0x1U << 6U)
#define    FL_CMU_GROUP1_BUSCLK_PAD                               (0x1U << 7U)
#define    FL_CMU_GROUP1_BUSCLK_SVD                               (0x1U << 8U)
#define    FL_CMU_GROUP1_BUSCLK_COMP                              (0x1U << 9U)
#define    FL_CMU_GROUP1_BUSCLK_SENT0                             (0x1U << 19U)
#define    FL_CMU_GROUP1_BUSCLK_SENT1                             (0x1U << 20U)
#define    FL_CMU_GROUP1_BUSCLK_CLM0                              (0x1U << 26U)
#define    FL_CMU_GROUP1_BUSCLK_CLM1                              (0x1U << 27U)
#define    FL_CMU_GROUP1_BUSCLK_CLM2                              (0x1U << 28U)
#define    FL_CMU_GROUP2_BUSCLK_CRC                               (0x1U << 0U)
#define    FL_CMU_GROUP2_BUSCLK_DMA                               (0x1U << 4U)
#define    FL_CMU_GROUP2_BUSCLK_FLASH                             (0x1U << 5U)
#define    FL_CMU_GROUP2_BUSCLK_RAMBIST                           (0x1U << 6U)
#define    FL_CMU_GROUP2_BUSCLK_WWDT                              (0x1U << 7U)
#define    FL_CMU_GROUP2_BUSCLK_ADC                               (0x1U << 8U)
#define    FL_CMU_GROUP2_BUSCLK_DAC                               (0x1U << 10U)
#define    FL_CMU_GROUP2_BUSCLK_TSI                               (0x1U << 11U)
#define    FL_CMU_GROUP3_BUSCLK_SPI0                              (0x1U << 0U)
#define    FL_CMU_GROUP3_BUSCLK_SPI1                              (0x1U << 1U)
#define    FL_CMU_GROUP3_BUSCLK_SPI2                              (0x1U << 2U)
#define    FL_CMU_GROUP3_BUSCLK_QSPI                              (0x1U << 7U)
#define    FL_CMU_GROUP3_BUSCLK_UART0                             (0x1U << 8U)
#define    FL_CMU_GROUP3_BUSCLK_UART1                             (0x1U << 9U)
#define    FL_CMU_GROUP3_BUSCLK_UART2                             (0x1U << 10U)
#define    FL_CMU_GROUP3_BUSCLK_UART3                             (0x1U << 11U)
#define    FL_CMU_GROUP3_BUSCLK_UART4                             (0x1U << 12U)
#define    FL_CMU_GROUP3_BUSCLK_UART5                             (0x1U << 13U)
#define    FL_CMU_GROUP3_BUSCLK_UARTIR                            (0x1U << 14U)
#define    FL_CMU_GROUP3_BUSCLK_LPUART                            (0x1U << 16U)
#define    FL_CMU_GROUP3_BUSCLK_UART6                             (0x1U << 17U)
#define    FL_CMU_GROUP3_BUSCLK_UART7                             (0x1U << 18U)
#define    FL_CMU_GROUP3_BUSCLK_CANFD                             (0x1U << 22U)
#define    FL_CMU_GROUP3_BUSCLK_I2C0                              (0x1U << 24U)
#define    FL_CMU_GROUP3_BUSCLK_I2C1                              (0x1U << 25U)
#define    FL_CMU_GROUP4_BUSCLK_BSTIM16                           (0x1U << 0U)
#define    FL_CMU_GROUP4_BUSCLK_TAU0                              (0x1U << 4U)
#define    FL_CMU_GROUP4_BUSCLK_TAU1                              (0x1U << 5U)
#define    FL_CMU_GROUP4_BUSCLK_ATIM                              (0x1U << 7U)
#define    FL_CMU_GROUP1_OPCLKEN_EXTI                             (0x1U << 31U)
#define    FL_CMU_GROUP1_OPCLKEN_FLASH                            (0x1U << 30U)
#define    FL_CMU_GROUP1_OPCLKEN_LPUART                           (0x1U << 27U)
#define    FL_CMU_GROUP1_OPCLKEN_TSI                              (0x1U << 16U)
#define    FL_CMU_GROUP1_OPCLKEN_UART5                            (0x1U << 14U)
#define    FL_CMU_GROUP1_OPCLKEN_UART4                            (0x1U << 13U)
#define    FL_CMU_GROUP1_OPCLKEN_LINCKE                           (0x1U << 12U)
#define    FL_CMU_GROUP1_OPCLKEN_UART3                            (0x1U << 11U)
#define    FL_CMU_GROUP1_OPCLKEN_UART2                            (0x1U << 10U)
#define    FL_CMU_GROUP1_OPCLKEN_UART1                            (0x1U << 9U)
#define    FL_CMU_GROUP1_OPCLKEN_UART0                            (0x1U << 8U)
#define    FL_CMU_GROUP1_OPCLKEN_BSTIM16                          (0x1U << 2U)
#define    FL_CMU_GROUP1_OPCLKEN_LPTIM16                          (0x1U << 0U)
#define    FL_CMU_OPCLK_CANFD_COMM                                (0x1U << 1U)
#define    FL_CMU_OPCLK_CANFD_RAM                                 (0x1U << 0U)


#define    FL_CMU_APB2CLK_PSC_DIV1                                (0x0U << CMU_SYSCLKSEL_APB2PRES_Pos)
#define    FL_CMU_APB2CLK_PSC_DIV2                                (0x4U << CMU_SYSCLKSEL_APB2PRES_Pos)


#define    FL_CMU_APB1CLK_PSC_DIV1                                (0x0U << CMU_SYSCLKSEL_APB1PRES_Pos)
#define    FL_CMU_APB1CLK_PSC_DIV2                                (0x4U << CMU_SYSCLKSEL_APB1PRES_Pos)
#define    FL_CMU_APB1CLK_PSC_DIV4                                (0x5U << CMU_SYSCLKSEL_APB1PRES_Pos)
#define    FL_CMU_APB1CLK_PSC_DIV8                                (0x6U << CMU_SYSCLKSEL_APB1PRES_Pos)
#define    FL_CMU_APB1CLK_PSC_DIV16                               (0x7U << CMU_SYSCLKSEL_APB1PRES_Pos)


#define    FL_CMU_AHBCLK_PSC_DIV1                                 (0x0U << CMU_SYSCLKSEL_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV2                                 (0x4U << CMU_SYSCLKSEL_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV4                                 (0x5U << CMU_SYSCLKSEL_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV8                                 (0x6U << CMU_SYSCLKSEL_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV16                                (0x7U << CMU_SYSCLKSEL_AHBPRES_Pos)


#define    FL_CMU_SYSTICK_CLK_SOURCE_SCLK                         (0x0U << CMU_SYSCLKSEL_STCLKSEL_Pos)
#define    FL_CMU_SYSTICK_CLK_SOURCE_LSCLK                        (0x1U << CMU_SYSCLKSEL_STCLKSEL_Pos)
#define    FL_CMU_SYSTICK_CLK_SOURCE_SYSCLK                       (0x3U << CMU_SYSCLKSEL_STCLKSEL_Pos)


#define    FL_CMU_SYSTEM_CLK_SOURCE_RCHF                          (0x0U << CMU_SYSCLKSEL_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_XTHF                          (0x1U << CMU_SYSCLKSEL_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_PLL                           (0x2U << CMU_SYSCLKSEL_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_XTLF                          (0x5U << CMU_SYSCLKSEL_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_RCLP                          (0x6U << CMU_SYSCLKSEL_SYSCLKSEL_Pos)


