Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_cmu.h
/**
  * @brief    Get Group1 Periph Bus Clock Enable Status
  * @rmtoll   PCLKCR1        FL_CMU_IsEnabledGroup1BusClock
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_APB2CLK_PSC
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_APB2CLK_PSC
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_APB1CLK_PSC
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_APB1CLK_PSC
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_AHBCLK_PSC
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_AHBCLK_PSC
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_SYSTICK_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_SYSTICK_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_SYSTEM_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_SYSTEM_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_RCHF_FREQUENCY
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_RCHF_FREQUENCY
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_PLL_PSC
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_PLL_PSC
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_PLL_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_PLL_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_XTLF_START_WAIT_CYCLE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_XTLF_START_WAIT_CYCLE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_XTLF_FDET
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_XTLF_FDET
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_LSCLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_SET_LSCLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_XTHF_START_WAIT_CYCLE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_XTHF_START_WAIT_CYCLE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_EXTI_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_EXTI_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_LPUART_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_LPUART_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART5_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART5_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART4_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART4_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_BSTIM16_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_BSTIM16_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_LPTIM16_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_LPTIM16_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART3_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART3_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART2_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART2_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART1_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART1_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART0_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART0_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_AHB_MASTER_PRIORITY
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_AHB_MASTER_PRIORITY
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_CANFD_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_CANFD_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_CANFDRAM_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_CANFDRAM_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_GROUP1_BUSCLK_SCU
  *           @arg @ref FL_CMU_GROUP1_BUSCLK_IWDT
  *           @arg @ref FL_CMU_GROUP1_BUSCLK_ANAC
  *           @arg @ref FL_CMU_GROUP1_BUSCLK_PAD
  *           @arg @ref FL_CMU_GROUP1_BUSCLK_SVD
  *           @arg @ref FL_CMU_GROUP1_BUSCLK_COMP
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CMU_IsEnabledGroup1BusClock(uint32_t peripheral)
{
    return (uint32_t)(READ_BIT(CMU->PCLKCR1, ((peripheral & 0xffffffff) << 0x0U)) == ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Get Group2 Periph Bus Clock Enable Status
  * @rmtoll   PCLKCR2        FL_CMU_IsEnabledGroup2BusClock
  * @param    peripheral This parameter can be one of the following values:
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CMU_IsEnabledGroup2BusClock(uint32_t peripheral)
{
    return (uint32_t)(READ_BIT(CMU->PCLKCR2, ((peripheral & 0xffffffff) << 0x0U)) == ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Get Group3 Periph Bus Clock Enable Status
  * @rmtoll   PCLKCR3        FL_CMU_IsEnabledGroup3BusClock
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_SPI0
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_SPI1
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_SPI2
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_QSPI
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_UART0
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_UART1
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_UART2
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_UART3
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_UART4
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_UART5
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_UARTIR
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_LPUART
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_UART6
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_UART7
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_CANFD
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_I2C0
  *           @arg @ref FL_CMU_GROUP3_BUSCLK_I2C1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CMU_IsEnabledGroup3BusClock(uint32_t peripheral)
{
    return (uint32_t)(READ_BIT(CMU->PCLKCR3, ((peripheral & 0xffffffff) << 0x0U)) == ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Get Group4 Periph Bus Clock Enable Status
  * @rmtoll   PCLKCR4        FL_CMU_IsEnabledGroup4BusClock
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_CMU_GROUP4_BUSCLK_BSTIM16
  *           @arg @ref FL_CMU_GROUP4_BUSCLK_TAU0
  *           @arg @ref FL_CMU_GROUP4_BUSCLK_TAU1
  *           @arg @ref FL_CMU_GROUP4_BUSCLK_ATIM
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CMU_IsEnabledGroup4BusClock(uint32_t peripheral)
{
    return (uint32_t)(READ_BIT(CMU->PCLKCR4, ((peripheral & 0xffffffff) << 0x0U)) == ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Enable Periph Operation Clock
  * @rmtoll   OPCER1        FL_CMU_EnableOperationClock
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_EXTI
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_FLASH
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_LPUART
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_TSI
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART5
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART4
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_LINCKE
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART3
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART2
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART1
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART0
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_BSTIM16
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_LPTIM16
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_EnableOperationClock(uint32_t peripheral)
{
    SET_BIT(CMU->OPCER1, ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Disable Periph Operation Clock
  * @rmtoll   OPCER1        FL_CMU_DisableOperationClock
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_EXTI
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_FLASH
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_LPUART
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_TSI
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART5
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART4
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_LINCKE
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART3
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART2
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART1
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART0
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_BSTIM16
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_LPTIM16
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_DisableOperationClock(uint32_t peripheral)
{
    CLEAR_BIT(CMU->OPCER1, ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Get Periph Operation Clock Enable Status
  * @rmtoll   OPCER1        FL_CMU_IsEnabledOperationClock
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_EXTI
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_FLASH
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_LPUART
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_TSI
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART5
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART4
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_LINCKE
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART3
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART2
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART1
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_UART0
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_BSTIM16
  *           @arg @ref FL_CMU_GROUP1_OPCLKEN_LPTIM16
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CMU_IsEnabledOperationClock(uint32_t peripheral)
{
    return (uint32_t)(READ_BIT(CMU->OPCER1, ((peripheral & 0xffffffff) << 0x0U)) == ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Set EXTI Clock Source
  * @rmtoll   OPCCR1    EXTICKS    FL_CMU_SetEXTIClockSource
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_EXTI_CLK_SOURCE_LSCLK
  *           @arg @ref FL_CMU_EXTI_CLK_SOURCE_HCLK
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetEXTIClockSource(uint32_t clock)
{
    MODIFY_REG(CMU->OPCCR1, CMU_OPCCR1_EXTICKS_Msk, clock);
}

/**
  * @brief    Get EXTI Clock Source Setting
  * @rmtoll   OPCCR1    EXTICKS    FL_CMU_GetEXTIClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_EXTI_CLK_SOURCE_LSCLK
  *           @arg @ref FL_CMU_EXTI_CLK_SOURCE_HCLK
  */
__STATIC_INLINE uint32_t FL_CMU_GetEXTIClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->OPCCR1, CMU_OPCCR1_EXTICKS_Msk));
}

/**
  * @brief    Set LPUART Clock Source
  * @rmtoll   OPCCR1    LPUARTCKS    FL_CMU_SetLPUARTClockSource
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_LPUART_CLK_SOURCE_XTLF
  *           @arg @ref FL_CMU_LPUART_CLK_SOURCE_RCHFPSC
  *           @arg @ref FL_CMU_LPUART_CLK_SOURCE_RCLP
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetLPUARTClockSource(uint32_t clock)
{
    MODIFY_REG(CMU->OPCCR1, CMU_OPCCR1_LPUARTCKS_Msk, clock);
}

/**
  * @brief    Get LPUART Clock Source Setting
  * @rmtoll   OPCCR1    LPUARTCKS    FL_CMU_GetLPUARTClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_LPUART_CLK_SOURCE_XTLF
  *           @arg @ref FL_CMU_LPUART_CLK_SOURCE_RCHFPSC
  *           @arg @ref FL_CMU_LPUART_CLK_SOURCE_RCLP
  */
__STATIC_INLINE uint32_t FL_CMU_GetLPUARTClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->OPCCR1, CMU_OPCCR1_LPUARTCKS_Msk));
}

/**
  * @brief    Set I2C_SMB1 Clock Source
  * @rmtoll   OPCCR1    UART5CKS    FL_CMU_SetUART5ClockSource
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_UART5_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_UART5_CLK_SOURCE_RCHF
  *           @arg @ref FL_CMU_UART5_CLK_SOURCE_SYSCLK
  *           @arg @ref FL_CMU_UART5_CLK_SOURCE_XTHF
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetUART5ClockSource(uint32_t clock)
{
    MODIFY_REG(CMU->OPCCR1, CMU_OPCCR1_UART5CKS_Msk, clock);
}

/**
  * @brief    Get I2C_SMB1 Source Setting
  * @rmtoll   OPCCR1    UART5CKS    FL_CMU_GetUART5ClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_UART5_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_UART5_CLK_SOURCE_RCHF
  *           @arg @ref FL_CMU_UART5_CLK_SOURCE_SYSCLK
  *           @arg @ref FL_CMU_UART5_CLK_SOURCE_XTHF
  */
__STATIC_INLINE uint32_t FL_CMU_GetUART5ClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->OPCCR1, CMU_OPCCR1_UART5CKS_Msk));
}

/**
  * @brief    Set I2C_SMB0 Clock Source
  * @rmtoll   OPCCR1    UART4CKS    FL_CMU_SetUART4ClockSource
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_UART4_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_UART4_CLK_SOURCE_RCHF
  *           @arg @ref FL_CMU_UART4_CLK_SOURCE_SYSCLK
  *           @arg @ref FL_CMU_UART4_CLK_SOURCE_XTHF
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetUART4ClockSource(uint32_t clock)
{
    MODIFY_REG(CMU->OPCCR1, CMU_OPCCR1_UART4CKS_Msk, clock);
}

/**
  * @brief    Get I2C_SMB0 Source Setting
  * @rmtoll   OPCCR1    UART4CKS    FL_CMU_GetUART4ClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_UART4_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_UART4_CLK_SOURCE_RCHF
  *           @arg @ref FL_CMU_UART4_CLK_SOURCE_SYSCLK
  *           @arg @ref FL_CMU_UART4_CLK_SOURCE_XTHF
  */
__STATIC_INLINE uint32_t FL_CMU_GetUART4ClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->OPCCR1, CMU_OPCCR1_UART4CKS_Msk));
}

/**
  * @brief    Set BSTIM16 Clock Source
  * @rmtoll   OPCCR1    BT16CKS    FL_CMU_SetBSTIM16ClockSource
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CMU_BSTIM16_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_BSTIM16_CLK_SOURCE_LSCLK
  *           @arg @ref FL_CMU_BSTIM16_CLK_SOURCE_RCLP
  *           @arg @ref FL_CMU_BSTIM16_CLK_SOURCE_XTLF
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_SetBSTIM16ClockSource(uint32_t clock)
{
    MODIFY_REG(CMU->OPCCR1, CMU_OPCCR1_BT16CKS_Msk, clock);
}

/**
  * @brief    Get BSTIM16 Clock Source Setting
  * @rmtoll   OPCCR1    BT16CKS    FL_CMU_GetBSTIM16ClockSource
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CMU_BSTIM16_CLK_SOURCE_APBCLK
  *           @arg @ref FL_CMU_BSTIM16_CLK_SOURCE_LSCLK
  *           @arg @ref FL_CMU_BSTIM16_CLK_SOURCE_RCLP
  *           @arg @ref FL_CMU_BSTIM16_CLK_SOURCE_XTLF
  */
__STATIC_INLINE uint32_t FL_CMU_GetBSTIM16ClockSource(void)
{
    return (uint32_t)(READ_BIT(CMU->OPCCR1, CMU_OPCCR1_BT16CKS_Msk));
}

